-- phpMyAdmin SQL Dump
-- version 3.3.8.1
-- http://www.phpmyadmin.net
--
-- 主机: w.rdc.sae.sina.com.cn:3307
-- 生成日期: 2015 年 06 月 25 日 21:22
-- 服务器版本: 5.5.23
-- PHP 版本: 5.3.3

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- 数据库: `app_movietimeapp`
--

-- --------------------------------------------------------

--
-- 表的结构 `cinema_list`
--

CREATE TABLE IF NOT EXISTS `cinema_list` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `影院` text NOT NULL,
  `地址` text NOT NULL,
  `电话` varchar(20) NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- 转存表中的数据 `cinema_list`
--

INSERT INTO `cinema_list` (`编号`, `影院`, `地址`, `电话`) VALUES
(1, '杭州UME', '杭州市文二西路551号西城广场4楼', '0571-88100999'),
(2, '杭州中影国际影城', '杭州市滨江区江南大道228号星光大道2幢4层', '0571-88924988'),
(3, '杭州比高', '杭州市拱墅区小河路488号运河天地4幢', '0571-28066699'),
(4, '杭州百老汇', '杭州市江干区富春路701号万象城三层', '0571-8905568-801'),
(5, '杭州保利', '杭州紫金港路21号西溪天堂商业街', '0571-88966687888');

-- --------------------------------------------------------

--
-- 表的结构 `movie_arrangement_today`
--

CREATE TABLE IF NOT EXISTS `movie_arrangement_today` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `影院` text CHARACTER SET utf8 NOT NULL,
  `片名` text CHARACTER SET utf8 NOT NULL,
  `时间` time NOT NULL,
  `播放类型` varchar(20) CHARACTER SET utf8 NOT NULL,
  `票价` int(20) NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=58 ;

--
-- 转存表中的数据 `movie_arrangement_today`
--

INSERT INTO `movie_arrangement_today` (`编号`, `影院`, `片名`, `时间`, `播放类型`, `票价`) VALUES
(1, '杭州UME', '速度与激情7', '13:00:00', '3D', 70),
(2, '杭州中影国际影城', '速度与激情7', '16:50:00', '3D', 70),
(3, '杭州UME', '战狼', '14:20:00', '3D', 70),
(4, '杭州UME', '速度与激情7', '14:15:00', '3D', 70),
(5, '杭州比高', '咱们结婚吧', '16:50:00', '2D', 48),
(6, '杭州中影国际影城', '我是女王', '15:45:00', '2D', 40),
(7, '杭州比高', '战狼', '12:00:00', 'IMAX', 150),
(8, '杭州百老汇', '速度与激情7', '11:44:00', '3D', 50),
(9, '杭州保利', '万物生长', '20:55:00', '3D', 60),
(10, '杭州保利', '速度与激情7', '21:22:00', 'IMAX', 100),
(11, '杭州比高', '速度与激情7', '13:23:00', '3D', 50),
(12, '杭州百老汇', '速度与激情7', '17:37:00', 'IMAX', 100),
(13, '杭州UME', '我是女王', '20:40:00', '2D', 40),
(14, '杭州百老汇', '万物生长', '15:20:00', '3D', 60),
(15, '杭州百老汇', '万物生长', '14:44:00', '3D', 50),
(16, '杭州百老汇', '我是女王', '11:22:00', '2D', 40),
(18, '杭州保利', '战狼', '14:00:00', '3D', 60),
(19, '杭州保利', '咱们结婚吧', '14:42:00', '2D', 50),
(20, '杭州比高', '咱们结婚吧', '13:40:00', '2D', 50),
(36, '杭州中影国际影城', '我是女王', '17:20:00', '2D', 50),
(17, '杭州保利', '战狼', '16:23:00', '3D', 60),
(42, '杭州中影国际影城', '我是女王', '17:05:00', '2D', 50),
(34, '杭州保利', '战狼', '20:30:00', 'IMAX', 120),
(41, '杭州中影国际影城', '速度与激情7', '12:50:00', '3D', 70),
(43, '杭州中影国际影城', '战狼', '11:30:00', '3D', 60),
(57, '杭州保利', '失孤', '12:00:00', '2D', 60),
(49, '杭州保利', '左耳', '17:40:00', '2D', 60),
(52, '杭州保利', '万物生长', '17:30:00', 'IMAX', 120);

-- --------------------------------------------------------

--
-- 表的结构 `movie_arrangement_tomorrow`
--

CREATE TABLE IF NOT EXISTS `movie_arrangement_tomorrow` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `影院` text CHARACTER SET utf8 NOT NULL,
  `片名` text CHARACTER SET utf8 NOT NULL,
  `时间` time NOT NULL,
  `播放类型` varchar(20) CHARACTER SET utf8 NOT NULL,
  `票价` int(20) NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=28 ;

--
-- 转存表中的数据 `movie_arrangement_tomorrow`
--

INSERT INTO `movie_arrangement_tomorrow` (`编号`, `影院`, `片名`, `时间`, `播放类型`, `票价`) VALUES
(1, '杭州比高', '速度与激情7', '13:00:00', '3D', 70),
(2, '杭州UME', '速度与激情7', '16:50:00', '3D', 70),
(3, '杭州比高', '战狼', '14:20:00', '3D', 70),
(4, '杭州比高', '速度与激情7', '14:15:00', '3D', 70),
(5, '杭州比高', '咱们结婚吧', '16:50:00', '2D', 48),
(6, '杭州UME', '我是女王', '15:45:00', '2D', 40),
(7, '杭州比高', '战狼', '12:00:00', 'IMAX', 150),
(8, '杭州中影国际影城', '速度与激情7', '11:44:00', '3D', 50),
(9, '杭州百老汇', '万物生长', '20:55:00', '3D', 60),
(10, '杭州百老汇', '速度与激情7', '21:22:00', 'IMAX', 100),
(11, '杭州保利', '速度与激情7', '13:23:00', '3D', 50),
(12, '杭州中影国际影城', '速度与激情7', '17:37:00', 'IMAX', 100),
(13, '杭州比高', '我是女王', '20:40:00', '2D', 40),
(14, '杭州中影国际影城', '万物生长', '15:20:00', '3D', 60),
(15, '杭州中影国际影城', '万物生长', '14:44:00', '3D', 50),
(16, '杭州中影国际影城', '我是女王', '11:22:00', '2D', 40),
(17, '杭州UME', '战狼', '16:23:00', '3D', 70),
(18, '杭州百老汇', '战狼', '13:00:00', '3D', 60),
(19, '杭州百老汇', '咱们结婚吧', '14:42:00', '2D', 50),
(20, '杭州UME', '咱们结婚吧', '13:40:00', '2D', 50),
(21, '杭州UME', '我是女王', '22:32:00', '2D', 60),
(22, '杭州保利', '咱们结婚吧', '12:00:00', '2D', 40),
(23, '杭州保利', '咱们结婚吧', '16:40:00', '2D', 50),
(24, '杭州保利', '战狼', '20:30:00', 'IMAX', 120),
(25, '杭州保利', '战狼', '21:20:00', '3D', 70);

-- --------------------------------------------------------

--
-- 表的结构 `movie_list`
--

CREATE TABLE IF NOT EXISTS `movie_list` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `片名` text COLLATE utf8_unicode_ci NOT NULL,
  `演员` text COLLATE utf8_unicode_ci NOT NULL,
  `影片类型` text COLLATE utf8_unicode_ci NOT NULL,
  `电影时长` text COLLATE utf8_unicode_ci NOT NULL,
  `介绍` text COLLATE utf8_unicode_ci NOT NULL,
  `海报` varchar(100) COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci AUTO_INCREMENT=12 ;

--
-- 转存表中的数据 `movie_list`
--

INSERT INTO `movie_list` (`编号`, `片名`, `演员`, `影片类型`, `电影时长`, `介绍`, `海报`) VALUES
(1, '速度与激情7', '范·迪塞尔,保罗·沃克,杰森·斯坦森', '动作/犯罪/惊悚', '137分钟', '《速7》的故事将在多米尼克的团队和大反派德卡特·肖之间展开。多米尼克和他的挚友们结束上一部影片中和大反派欧文·肖在伦敦的战斗之后，回到美国，过上了向往已久的平静生活。但他们在伦敦结下的梁子很快打破了这种平静。欧文·肖的哥哥德卡特·肖以不择手段、心狠手辣闻名，为了替弟弟复仇，他誓要与多米尼克家族一决高下。', 'suduyujiqing7.jpg'),
(2, '战狼', '吴京,余男,斯科特·阿特金斯', '动作/战争', '90分钟', '痞性十足的冷锋（吴京 饰）屡屡惹祸，有人说他是流氓，是痞子， 也有人说他是英雄，是传奇，一次行动中冷锋违抗军令打死了恐怖分子，要被开除出队，却意外得到了神秘部队战狼的接纳，但本想换个地方继续惹祸的他却跳进了另外一个深渊， 被美军前海豹突击队盯上 ；冷傲的战狼副队长；性感的女上司；心计颇深腹黑的毒枭，枉死的队友，雇佣兵跨过边境线入侵中国.......一切都使他陷入了麻烦中。', 'zhanlang.jpg'),
(3, '我是女王', '宋慧乔,陈乔恩,邬君梅,伊能静', '剧情', '106分钟', '艺人Annie（宋慧乔 饰）多年的恋情走到了尽头，幸好，还有Candy（陈乔恩 饰）、Tina（邬君梅 饰）这样的死党不离不弃；不想，掳走了Annie恋人的Melissa（伊能静 饰）在事业上同样步步紧逼！Melissa的一手操控，将猝不及防的Annie推到了舆论的风尖浪口，同时好友Candy和Tina相继跌入了情感漩涡的波诡谷底，Annie在孤独中清醒地发现，无论是Mark（窦骁 饰）还是王子煜（郑元畅 饰），都不可能为自己全部地分担…… \r\n　　痛定思痛的Annie终于鼓起勇气，决意去面对所有的质疑、伤痛与不理解，因为彼时的她，不只为她一个人的人生战斗，亦是在为一直以来不离不弃的好姐妹们…… ', 'woshinvwang.jpg'),
(4, '万物生长', '范冰冰,韩庚,齐溪,吴莫愁', '爱情/剧情', '105分钟', '秋水（韩庚 饰），医科大学的学生，与厚朴（张博宇 饰）、黄芪（杨迪 饰）、辛夷（赵一维 饰）是死党，正值青春期的他们在旺盛荷尔蒙支配下异常生猛，不停地寻找着“猎食”对象。 \r\n　　含苞待放的小满（李梦 饰）是秋水念念不忘的初恋；大腿紧实的白露（齐溪 饰）是与秋水互相奉献童贞的前任；熟透了的柳青（范冰冰 饰）是秋水眼中千娇百媚的女神；胸大无脑的娟儿（沈婷婷 饰）是黄芪心中的宝贝；特异独行的魏妍（吴莫愁 饰）则是厚朴求之不得的真爱；唯独辛夷整个大学都“守身如玉”。 \r\n　　青春就在他们一次次荷尔蒙的释放中渐行渐远……', 'wanwushengzhang.jpg'),
(5, '咱们结婚吧', '高圆圆,姜武,郭碧婷,李晨', '剧情', '127分钟', '一座城，四段爱。单身婚纱店长叶雯雯（高圆圆 饰）秉持“优胜劣汰”的恋爱法则，一直渴望找到MR.Right，穿上最美婚纱步入婚姻殿堂，然而在前男友的“纠缠”中，险些错过那个在旁温暖守候的婚纱设计师陈震轩（姜武 饰）。经历7年爱情长跑婚礼在即，一心想成为小提琴手的文艺（郭碧婷 饰）却在异国他乡遭遇心仪的神秘男子李想（李晨 饰），一纸婚约与甜蜜心动，化作一场三人的爱情角力。痴心机场地勤女顾小蕾（陈意涵 饰）逼婚年轻帅气的副机长男友凌霄（郑恺 饰），但对方百般逃避疑似变心，爱情无处落脚，缘分也将破碎，两人又该何去何从？女强人田海心（刘涛 饰）在事业上升期意外怀孕陷入艰难抉择，而一向迁就老婆的烤鸭师傅曹大鹏（王自健 饰），这一次为了孩子幸福即使离婚也绝不退让，婚姻出现裂痕，爱情何以保全。咱们结婚吧，你将拿出怎样的心，去交付那个陪你走完一生的伴侣？', 'zanmenjiehunba.jpg'),
(8, '复仇者联盟2', '小罗伯特·唐尼,克里斯·埃文斯,克里斯·海姆斯沃斯,斯嘉丽·约翰逊', '动作/冒险/科幻', '141分钟', '影片故事承接上一集，钢铁侠研发的一个维和项目意外成为危机导火索，本来用于保护世界的奥创机器人却拥有了自我意识，扭曲的信念导致它掀起了一场意图灭绝人类的邪恶攻势。超级英雄们——钢铁侠、美国队长、雷神、绿巨人、黑寡妇和鹰眼等面临着又一次艰巨考验，他们更因为各自理念发生争执，内部矛盾使得复仇者联盟几近分崩离析。随着奥创崛起，复仇者联盟必须重新站在一起面对前所未有的强大劲敌；一场遍布全球、独一无二的史诗冒险就此展开！', 'fuchouzhelianmeng2.jpg'),
(9, '左耳', '陈都灵,欧豪,杨洋', '爱情', '117分钟', '《左耳》故事讲述了十七岁的女孩李珥，左耳听力不好，如果站在左边说话就听不见，不起眼而内向的李珥某天突然就暗恋男生许弋，而同时许弋却被放浪女孩吧啦追求到手。心碎的李珥在偶然的机会和吧啦成为朋友，也认识了吧啦真正心爱的男生.', 'zuoer.jpg');

-- --------------------------------------------------------

--
-- 表的结构 `notification`
--

CREATE TABLE IF NOT EXISTS `notification` (
  `通知` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `notification`
--

INSERT INTO `notification` (`通知`) VALUES
('1.Movie Time管理系统正式上线啦~');

-- --------------------------------------------------------

--
-- 表的结构 `reservation_list`
--

CREATE TABLE IF NOT EXISTS `reservation_list` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `姓名` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `联系电话` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `片名` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `影院` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `播放类型` varchar(20) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `日期` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `时间` time NOT NULL,
  `座位` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `票价` int(20) NOT NULL,
  `排` int(10) NOT NULL,
  `列` int(10) NOT NULL,
  PRIMARY KEY (`编号`),
  UNIQUE KEY `编号` (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=24 ;

--
-- 转存表中的数据 `reservation_list`
--

INSERT INTO `reservation_list` (`编号`, `姓名`, `联系电话`, `片名`, `影院`, `播放类型`, `日期`, `时间`, `座位`, `票价`, `排`, `列`) VALUES
(1, '王小明', '17636849762', '速度与激情7', '杭州中影国际影城', '3D', '今天', '16:50:00', '3排3座', 70, 2, 2),
(2, '王小明', '17636849762', '速度与激情7', '杭州中影国际影城', '3D', '今天', '16:50:00', '3排4座', 70, 2, 3),
(3, '王小明', '17636849762', '速度与激情7', '杭州中影国际影城', '3D', '今天', '16:50:00', '3排5座', 70, 2, 4),
(10, '张东', '17491739128', '战狼', '杭州保利', '3D', '今天', '16:23:00', '3排3座', 60, 2, 2),
(5, '飘飘', '14890789046', '我是女王', '杭州UME', '2D', '今天', '20:40:00', '3排4座', 40, 2, 3),
(6, '飘飘', '14890789046', '我是女王', '杭州UME', '2D', '今天', '20:40:00', '3排5座', 40, 2, 4),
(7, '飘飘', '14890789046', '我是女王', '杭州UME', '2D', '今天', '20:40:00', '3排6座', 40, 2, 5),
(8, '陈刚', '15487631245', '速度与激情7', '杭州百老汇', '3D', '今天', '11:44:00', '3排4座', 50, 2, 3),
(9, '陈刚', '15487631245', '速度与激情7', '杭州百老汇', '3D', '今天', '11:44:00', '3排5座', 50, 2, 4),
(11, '张东', '17491739128', '战狼', '杭州保利', '3D', '今天', '16:23:00', '3排4座', 60, 2, 3),
(15, '李二', '17638499274', '战狼', '杭州保利', '3D', '今天', '16:23:00', '4排5座', 60, 3, 4),
(16, '李二', '17638499274', '战狼', '杭州保利', '3D', '今天', '16:23:00', '4排6座', 60, 3, 5),
(17, '鲁佩', '13567898765', '战狼', '杭州保利', '3D', '今天', '16:23:00', '3排6座', 60, 2, 5),
(18, '曹操', '18678533478', '战狼', '杭州保利', '3D', '今天', '16:23:00', '5排4座', 60, 4, 3),
(19, '曹操', '18678533478', '战狼', '杭州保利', '3D', '今天', '16:23:00', '5排5座', 60, 4, 4),
(20, '陈三', '13864876894', '战狼', '杭州保利', '3D', '今天', '14:00:00', '3排4座', 60, 2, 3),
(21, '陈三', '13864876894', '战狼', '杭州保利', '3D', '今天', '14:00:00', '3排5座', 60, 2, 4),
(22, '伊伊', '19362845384', '战狼', '杭州保利', '3D', '明天', '21:20:00', '6排4座', 70, 5, 3),
(23, '伊伊', '19362845384', '战狼', '杭州保利', '3D', '明天', '21:20:00', '6排5座', 70, 5, 4);

-- --------------------------------------------------------

--
-- 表的结构 `temp_movie_list`
--

CREATE TABLE IF NOT EXISTS `temp_movie_list` (
  `编号` int(20) NOT NULL AUTO_INCREMENT,
  `片名` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=9 ;

--
-- 转存表中的数据 `temp_movie_list`
--

INSERT INTO `temp_movie_list` (`编号`, `片名`) VALUES
(8, '失孤');

-- --------------------------------------------------------

--
-- 表的结构 `user_list`
--

CREATE TABLE IF NOT EXISTS `user_list` (
  `编号` int(11) NOT NULL AUTO_INCREMENT,
  `用户名` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `密码` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `邮箱` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `联系电话` varchar(100) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `地址` text CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL,
  `管理员权限` int(5) NOT NULL,
  PRIMARY KEY (`编号`)
) ENGINE=MyISAM  DEFAULT CHARSET=utf8 AUTO_INCREMENT=11 ;

--
-- 转存表中的数据 `user_list`
--

INSERT INTO `user_list` (`编号`, `用户名`, `密码`, `邮箱`, `联系电话`, `地址`, `管理员权限`) VALUES
(1, '管理员', '123456', 'guanliyuan@163.com', '4008820820', '', 1),
(2, '杭州UME', '123456', 'hangzhouunm@qq.com', '0571-88100999', '杭州市文二西路551号西城广场4楼', 0),
(3, '杭州中影国际影城', '11', '88924988@163.com', '0571-88924988', '杭州市滨江区江南大道228号星光大道2幢4层', 0),
(4, '杭州比高', '123456', 'hangzhoubigao@162.com', '0571-28066699', '杭州市拱墅区小河路488号运河天地4幢', 0),
(5, '杭州百老汇', '123456', 'bailaohui@zjut.com', '0571-8905568-801', '杭州市江干区富春路701号万象城三层', 0),
(6, '杭州保利', '123456', 'baolidianying@sina.com', '0571-88966687888', '杭州紫金港路21号西溪天堂商业街', 0);
